#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_domain.rileysnyder_org will be created
  + resource "digitalocean_domain" "rileysnyder_org" {
      + id   = (known after apply)
      + name = "rileysnyder.org"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_record.code will be created
  + resource "digitalocean_record" "code" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "code"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.146.252.4"
    }

  # digitalocean_record.files will be created
  + resource "digitalocean_record" "files" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "files"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.146.252.4"
    }

  # digitalocean_record.lighthouse will be created
  + resource "digitalocean_record" "lighthouse" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "lighthouse"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.146.252.4"
    }

  # digitalocean_record.metrics will be created
  + resource "digitalocean_record" "metrics" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "metrics"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.146.252.4"
    }

  # digitalocean_record.minecraft will be created
  + resource "digitalocean_record" "minecraft" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "minecraft"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.146.252.4"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rssnyder, Action: `pull_request`*